var a = 1, b = 1, c, d;
c = ++a; alert(c);           // 2 префиксный оператор инкремента
d = b++; alert(d);           // 1 постфиксный оператор инкремента
c = (2 + ++a); alert(c);      // 5 =2+(1+2)-имеет наивысший приоритет
d = (2 + b++); alert(d);      // 4= 2+2(здесь b=3, но возвращяется 2-постфиксный)
alert(a);                    // 3 указано в 3 строке
alert(b);                    // 3 указано в 4 строке


/*Чему будет равен x в примере ниже? */
var z = 2;
var x = 1 + (z *= 2); //Здесь по факту (z= z*2)=4
alert(x);// X=5