"""
Реализовать функцию my_func(), которая принимает три позиционных аргумента,
и возвращает сумму наибольших двух аргументов.
"""
#фунция принимает три позиционных аргумента тип int, преобразует их в последовательность сортирует от максимума
#  и возвращает сумму наибольших двух аргументов.
def my_func (x1,x2,x3):
    sp=list(x1,x2,x3)
    print(min(sp-list))
    sum_user=
    return sum_user

