"""
2)	Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
Использовать формулу: длина*ширина*масса асфальта для покрытия одного кв метра дороги асфальтом,
толщиной в 1 см*число см толщины полотна. Проверить работу метода.
Например: 20м*5000м*25кг*5см = 12500 т

"""
class Road:
    def __init__(self, length=0,width=0):
        self._length=length
        self._width=width
    def calc(self):

        delta=input('Введите толщину афальтового покрытия: ')
        delta=0 if delta=='' else int(delta)
        cost_user=input('Введите расход сфальта на 1 кв.м.*1 см., по умолчанию 25 кг/кв.м.: ')
        cost=25 if cost_user=='' else int(cost_user)                    # расход асфальта на 1 кв.м. при толщине 1 см.
        summa_as=self._length*self._width*delta*cost/1000               #Расчет тоннажа асфальта
        return summa_as, cost, delta                                    # Возврат данных в основноую программу даных

delta=0
cost=10
dlina=int(input('Введите длину полотна: '))
shirina=int(input('Введите ширину полотна: '))

a=Road(dlina,shirina)                                                      #Создали объект, при создании передали 2 пар.
summa,cost,delta=a.calc()                                                  #Вызвали метод, остальные данные запросим в методе

print(f'С данными: длина:{a._length} м., ширина{a._width}м., толщина{delta} см., и расход:{cost}кг.м.Масса асфальта: {summa} тонн')
