"""
2)	Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].

"""
# функция принимает на вход список и для нее создает таблицу от 1 до длины массива и начиная с номера списка(1-1=0),
# сравнивает все соседние элементы массива на условие(соседний справа больше) еесли выполняется то в новый список.
def find_sp(list_user):
    new_list=[ list_user[i] for i in range(1,len(list_user)) if (list_user[i-1]<list_user[i])]
    return new_list



list_user=[300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]

new_list=find_sp(list_user)
print(new_list)