"""
Реализовать формирование списка, используя функцию range() и возможности генератора.
В список должны войти четные числа от 100 до 1000 (включая границы).
Необходимо получить результат вычисления произведения всех элементов списка.
Подсказка: использовать функцию reduce().

"""

summa=1
list_user=[i for i in range(100,1000) if (i%2==0)]
for i in list_user:
    summa=summa*i
print(summa)

