"""
6)	Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет
и наличие лекционных, практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
 Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
Примеры строк файла: Информатика:   100(л)   50(пр)   20(лаб).
                                        Физика:   30(л)   —   10(лаб)
                                        Физкультура:   —   30(пр)   —
Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

"""
with open(r'text_6.txt',encoding='UTF-8') as file_user:
    try:
        dict_user={}
        mass=file_user.readlines()
        for el in mass:
            el_out=el.split(':')#Отделили первую фразу
            summa=0
            for sub in el_out[1]:
                if sub.isdigit():
                    continue
                else:
                    el_out[1]=el_out[1].replace(sub,' ')#Удалили ве лишние символы кроме цифр
            el_out[1]=el_out[1].split(' ')#отделили по пустым строкам
            for sub in el_out[1]:
                if not sub=='':
                    summa=summa+int(sub) #Копался здесь часа 3-4, застрял и все тут
            dict_user[el_out[0]]=summa
        print(dict_user)
    except IOError:
        print('Ошибка ввода-вывода')
