"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc():
    oper_type = input('Введите операцию(+,-,*,/ или 0 для выхода):')

    if oper_type == '0':
        return ('выход')
    else:

        if oper_type in '+-*/':
            try:
                num1 = int(input('Введите 1 число: '))
                num2 = int(input('Введите 2 число: '))

                if oper_type == '+':
                    res = num1 + num2
                    print(f'Result={res}')
                    return calc()
                elif oper_type == '-':
                    res = num1 - num2
                    print(f'Result={res}')
                    return calc()
                elif oper_type == '/':
                    if num2 != 0:
                        res = num1 / num2
                        print(f'Result={res}')
                        return calc()
                    else:
                        print('Деление на 0 нельзя:')
                        return calc()

                elif oper_type == '*':
                    res = num1 * num2
                    print(f'Result={res}')
                    return calc()
            except ValueError:
                print('Ввели вместо числа строку, исправьте')
                return calc()
        else:
            print('Ввведен неверный символ, ещё раз')
            return calc()


calc()
