"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

from  random import randint
# O(n^2)
def find_min(spis):
    for i in spis:
        is_min=True
        for j in spis:
            if i>j:
                is_min=False
        if is_min:
            return i

#O(n)
def  find_min2(spis):
    min_value=spis[0]
    for i in spis:
        if i<min_value:
            min_value=i
    return min_value


spis=[randint(0,100) for  i in range(20)]

print(find_min2(spis))
print(find_min(spis))